# ML Application for Attrition Rate

## Imporing libraries required

In [1]:
import pandas as pd
import numpy as np
import plotly.express as px

## Load data into dataframe

In [2]:
def get_data_as_df(path):
    return pd.read_csv(path)

In [3]:
dept_data = get_data_as_df('./data/preprocessing/dept_data.csv')
employee_data = get_data_as_df('./data/preprocessing/employee_data.csv')
employee_details = get_data_as_df('./data/preprocessing/employee_details.csv')

## A view on how the data looks like

In [4]:
dept_data.head()

   dept_id    dept_name              dept_head
0   D00-IT           IT             Henry Adey
1   D00-SS        Sales        Edward J Bayley
2   D00-TP         Temp        Micheal Zachrey
3  D00-ENG  Engineering  Sushant Raghunathan K
4   D00-SP      Support         Amelia Westray

In [5]:
employee_details.head()

   employee_id  age  gender marital_status
0       113558   43    Male        Married
1       112256   24  Female      Unmarried
2       112586   22  Female      Unmarried
3       108071   36    Male        Married
4       116915   38    Male        Married

In [6]:
employee_data.head()

,avg_monthly_hrs,department,filed_complaint,last_evaluation,n_projects,recently_promoted,salary,satisfaction,status,tenure,employee_id
0,246.0,NaN,NaN,0.866838,6,NaN,medium,0.134415,Left,4.0,124467
1,134.0,NaN,NaN,0.555718,2,NaN,low,0.511041,Left,3.0,112210
2,156.0,D00-SS,1.0,0.474082,2,NaN,medium,0.405101,Left,3.0,126150
3,256.0,D00-SP,NaN,0.961360,6,NaN,low,0.152974,Left,4.0,125346
4,146.0,D00-SS,NaN,0.507349,2,NaN,medium,0.434845,Left,3.0,113707

- syntax for renaming.
df.rename(columns={'actual_name':'new_name'})

In [9]:
# employee_data = employee_data.merge(dept_data, left_on=['department'], right_on=['dept_id'], how='left')
dept_data.rename(columns={'dept_id':'department'}, inplace=True)

In [10]:
dept_data.head()

  department    dept_name              dept_head
0     D00-IT           IT             Henry Adey
1     D00-SS        Sales        Edward J Bayley
2     D00-TP         Temp        Micheal Zachrey
3    D00-ENG  Engineering  Sushant Raghunathan K
4     D00-SP      Support         Amelia Westray

In [11]:
dept_data.columns

Index(['department', 'dept_name', 'dept_head'], dtype='object')

## A view on null records on each dataframe before consolidation

In [12]:
dept_data.isnull().sum()

department    0
dept_name     0
dept_head     0
dtype: int64

In [14]:
employee_data.isnull().sum()

avg_monthly_hrs          0
department             707
filed_complaint      12104
last_evaluation       1487
n_projects               0
recently_promoted    13853
salary                   0
satisfaction           150
status                   0
tenure                 150
employee_id              0
dtype: int64

In [13]:
employee_details.isnull().sum()

employee_id       0
age               0
gender            0
marital_status    0
dtype: int64

## merge all dataframes to consolidate records

- merging two dataframes usually has how [inner, left] and on [common_columsn]

In [15]:
print(employee_data.shape)
employee_data = employee_data.merge(dept_data, on=['department'], how='left')
print(employee_data.shape)
employee_data.head()

(14150, 11)
(14150, 13)

,avg_monthly_hrs,department,filed_complaint,last_evaluation,n_projects,recently_promoted,salary,satisfaction,status,tenure,employee_id,dept_name,dept_head
0,246.0,NaN,NaN,0.866838,6,NaN,medium,0.134415,Left,4.0,124467,NaN,NaN
1,134.0,NaN,NaN,0.555718,2,NaN,low,0.511041,Left,3.0,112210,NaN,NaN
2,156.0,D00-SS,1.0,0.474082,2,NaN,medium,0.405101,Left,3.0,126150,Sales,Edward J Bayley
3,256.0,D00-SP,NaN,0.961360,6,NaN,low,0.152974,Left,4.0,125346,Support,Amelia Westray
4,146.0,D00-SS,NaN,0.507349,2,NaN,medium,0.434845,Left,3.0,113707,Sales,Edward J Bayley

In [16]:
employee_data = employee_data.merge(employee_details, on='employee_id', how='left')

In [17]:
employee_data.shape

(14150, 16)

In [18]:
# consolidated data looks like this
employee_data.head()

,avg_monthly_hrs,department,filed_complaint,last_evaluation,n_projects,recently_promoted,salary,satisfaction,status,tenure,employee_id,dept_name,dept_head,age,gender,marital_status
0,246.0,NaN,NaN,0.866838,6,NaN,medium,0.134415,Left,4.0,124467,NaN,NaN,42.0,Female,Married
1,134.0,NaN,NaN,0.555718,2,NaN,low,0.511041,Left,3.0,112210,NaN,NaN,23.0,Female,Unmarried
2,156.0,D00-SS,1.0,0.474082,2,NaN,medium,0.405101,Left,3.0,126150,Sales,Edward J Bayley,24.0,Female,Unmarried
3,256.0,D00-SP,NaN,0.961360,6,NaN,low,0.152974,Left,4.0,125346,Support,Amelia Westray,51.0,Female,Married
4,146.0,D00-SS,NaN,0.507349,2,NaN,medium,0.434845,Left,3.0,113707,Sales,Edward J Bayley,23.0,Female,Unmarried

In [19]:
employee_data.isnull().sum()

avg_monthly_hrs          0
department             707
filed_complaint      12104
last_evaluation       1487
n_projects               0
recently_promoted    13853
salary                   0
satisfaction           150
status                   0
tenure                 150
employee_id              0
dept_name              914
dept_head              914
age                      5
gender                   5
marital_status           5
dtype: int64

In [20]:
employee_data['department'].unique()

array([nan, 'D00-SS', 'D00-SP', 'D00-MT', 'D00-PD', 'D00-IT', 'D00-AD',
       'D00-MN', 'D00-ENG', 'D00-PR', 'D00-TP', 'D00-FN', '-IT'],
      dtype=object)

## handling null values

### treating null values for department, dept_name, dept_head

In [21]:
employee_data['department'].value_counts(dropna=False)

D00-SS     3905
D00-ENG    2575
D00-SP     2113
D00-IT     1157
D00-PD      855
D00-MT      815
D00-FN      725
NaN         707
D00-MN      593
-IT         207
D00-AD      175
D00-PR      173
D00-TP      150
Name: department, dtype: int64

In [22]:
employee_data.loc[employee_data['department']=='-IT', 'department']

212      -IT
278      -IT
367      -IT
410      -IT
562      -IT
        ...
13611    -IT
13637    -IT
13655    -IT
13862    -IT
13942    -IT
Name: department, Length: 207, dtype: object

In [23]:
# errored out as we have -IT pattern for correct records as well
# employee_data['department'] = employee_data['department'].str.replace('-IT', 'D00-IT')
employee_data.loc[employee_data['department']=='-IT', 'department'] = 'D00-IT'

In [24]:
employee_data['department'].value_counts(dropna=False)

D00-SS     3905
D00-ENG    2575
D00-SP     2113
D00-IT     1364
D00-PD      855
D00-MT      815
D00-FN      725
NaN         707
D00-MN      593
D00-AD      175
D00-PR      173
D00-TP      150
Name: department, dtype: int64

In [20]:
employee_data.loc[employee_data['department']=='D00-IT', 'dept_name'] = 'IT'
employee_data.loc[employee_data['department']=='D00-IT', 'dept_head'] = 'Henry Adey'

In [25]:
# looking at the below data, we can replace the nulls with
# either D00-ENG or D00-PD. for now, we shall replace with D00-PD
# we can try with D00-ENG as a second model.
employee_data.groupby('department', dropna=False).agg(
    {'avg_monthly_hrs':['mean', 'count', 'nunique', 'max', 'min']}
)

           avg_monthly_hrs
                      mean count nunique    max    min
department
D00-AD          200.994286   175     106  300.0  105.0
D00-ENG         202.507184  2575     209  310.0   97.0
D00-FN          201.382069   725     176  310.0   97.0
D00-IT          202.253666  1364     194  308.0   96.0
D00-MN          200.655987   593     161  307.0   97.0
D00-MT          199.839264   815     181  310.0   96.0
D00-PD          199.783626   855     182  310.0   98.0
D00-PR          199.867052   173     111  308.0  111.0
D00-SP          200.731661  2113     204  310.0   96.0
D00-SS          200.878361  3905     214  310.0   96.0
D00-TP           99.533333   150      73  143.0   49.0
NaN             198.950495   707     175  310.0   98.0

In [26]:
employee_data.loc[employee_data['department'].isnull(), 'department'] = 'D00-PD'

In [30]:
dept_data.head(15)

   department    dept_name              dept_head
0      D00-IT           IT             Henry Adey
1      D00-SS        Sales        Edward J Bayley
2      D00-TP         Temp        Micheal Zachrey
3     D00-ENG  Engineering  Sushant Raghunathan K
4      D00-SP      Support         Amelia Westray
5      D00-FN      Finance              Aanchal J
6      D00-PR  Procurement            Louie Viles
7      D00-AD        Admin          Evelyn Tolson
8      D00-MN   Management          Ellie Trafton
9      D00-MT    Marketing           Reuben Swann
10     D00-PD      Product          Darcy Staines

In [31]:
# Engineering	Sushant Raghunathan K
employee_data.loc[employee_data['department']=='D00-PD', 'dept_name'] = 'Product'
employee_data.loc[employee_data['department']=='D00-PD', 'dept_head'] = 'Darcy Staines'

In [33]:
employee_data.loc[employee_data['dept_name'].isnull()]

,avg_monthly_hrs,department,filed_complaint,last_evaluation,n_projects,recently_promoted,salary,satisfaction,status,tenure,employee_id,dept_name,dept_head,age,gender,marital_status
212,137.0,D00-IT,NaN,0.543217,2,NaN,medium,0.442070,Left,3.0,126341,NaN,NaN,24.0,Female,Unmarried
278,262.0,D00-IT,NaN,0.901248,5,NaN,low,0.717886,Left,5.0,117187,NaN,NaN,24.0,Female,Unmarried
367,134.0,D00-IT,NaN,0.508337,2,NaN,medium,0.456376,Left,3.0,124194,NaN,NaN,22.0,Female,Unmarried
410,267.0,D00-IT,NaN,0.785357,5,NaN,low,0.927001,Left,5.0,119515,NaN,NaN,22.0,Female,Unmarried
562,127.0,D00-IT,NaN,0.559907,2,NaN,medium,0.440033,Left,3.0,119346,NaN,NaN,25.0,Female,Unmarried
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13611,223.0,D00-IT,NaN,0.897100,5,NaN,medium,0.895458,Left,5.0,133677,NaN,NaN,40.0,Female,Married
13637,123.0,D00-IT,NaN,0.774735,2,NaN,medium,0.508124,Employed,4.0,107214,NaN,NaN,24.0,Female,Unmarried
13655,216.0,D00-IT,NaN,0.736369,4,NaN,medium,0.856901,Employed,4.0,116349,NaN,NaN,54.0,Male,Married
13862,128.0,D00-IT,1.0,0.458317,3,NaN,low,0.447364,Employed,2.0,106545,NaN,NaN,23.0,Male,Unmarried
13942,242.0,D00-IT,NaN,0.931467,4,NaN,medium,0.635758,Employed,2.0,101735,NaN,NaN,28.0,Male,Unmarried

In [34]:
employee_data.loc[employee_data['department']=='D00-IT', 'dept_name'] = 'IT'
employee_data.loc[employee_data['department']=='D00-IT', 'dept_head'] = 'Henry Adey'

### treating null values for filed_complaint

In [36]:
employee_data['filed_complaint'].value_counts(dropna=False)

NaN    12104
1.0     2046
Name: filed_complaint, dtype: int64

In [37]:
employee_data['filed_complaint'] = employee_data['filed_complaint'].fillna(0)

### treating null values for recently_promoted

In [39]:
employee_data['recently_promoted'].value_counts(dropna=False)

NaN    13853
1.0      297
Name: recently_promoted, dtype: int64

In [40]:
employee_data['recently_promoted'] = employee_data['recently_promoted'].fillna(0)

### treating null values for age, gender, marital_status

In [28]:
employee_data['age'].value_counts(dropna=False)

24.0    1314
25.0    1249
23.0    1197
22.0    1170
27.0     662
29.0     661
28.0     647
26.0     626
42.0     303
37.0     284
33.0     279
47.0     278
32.0     277
30.0     276
48.0     274
40.0     272
41.0     271
46.0     271
39.0     270
36.0     269
38.0     269
45.0     266
43.0     265
35.0     262
52.0     252
44.0     250
34.0     243
49.0     243
53.0     235
50.0     235
54.0     228
51.0     228
31.0     225
55.0      38
57.0      34
56.0      22
NaN        5
Name: age, dtype: int64

In [41]:
employee_data['gender'].value_counts(dropna=False)

Male      9304
Female    4841
NaN          5
Name: gender, dtype: int64

In [30]:
employee_data['marital_status'].value_counts(dropna=False)

Unmarried    7226
Married      6919
NaN             5
Name: marital_status, dtype: int64

In [42]:
employee_data.describe()

,avg_monthly_hrs,filed_complaint,last_evaluation,n_projects,recently_promoted,satisfaction,tenure,employee_id,age
count,14150.000000,14150.000000,12663.000000,14150.000000,14150.000000,14000.000000,14000.000000,14150.000000,14145.000000
mean,199.994346,0.144594,0.718399,3.778304,0.020989,0.621212,3.499357,112080.750247,32.898621
std,50.833697,0.351703,0.173108,1.250162,0.143354,0.250482,1.462584,8748.202856,9.978939
min,49.000000,0.000000,0.316175,1.000000,0.000000,0.040058,2.000000,0.000000,22.000000
25%,155.000000,0.000000,0.563711,3.000000,0.000000,0.450356,3.000000,105772.500000,24.000000
50%,199.000000,0.000000,0.724731,4.000000,0.000000,0.652394,3.000000,111291.500000,29.000000
75%,245.000000,0.000000,0.871409,5.000000,0.000000,0.824925,4.000000,116650.750000,41.000000
max,310.000000,1.000000,1.000000,7.000000,1.000000,1.000000,10.000000,148988.000000,57.000000

In [43]:
employee_data['age'] = employee_data['age'].fillna(29.0)
employee_data['marital_status'] = employee_data['marital_status'].fillna('Unmarried')
employee_data['gender'] = employee_data['gender'].fillna('Male')

In [44]:
employee_data.isnull().sum()

avg_monthly_hrs         0
department              0
filed_complaint         0
last_evaluation      1487
n_projects              0
recently_promoted       0
salary                  0
satisfaction          150
status                  0
tenure                150
employee_id             0
dept_name               0
dept_head               0
age                     0
gender                  0
marital_status          0
dtype: int64

In [46]:
employee_data['tenure'].value_counts(dropna=False)

3.0     6018
2.0     3023
4.0     2394
5.0     1369
6.0      660
10.0     201
7.0      180
8.0      155
NaN      150
Name: tenure, dtype: int64

### treating null values for last_evaluation

In [47]:
employee_data['last_evaluation'].describe()

count    12663.000000
mean         0.718399
std          0.173108
min          0.316175
25%          0.563711
50%          0.724731
75%          0.871409
max          1.000000
Name: last_evaluation, dtype: float64

In [48]:
employee_data['le_median'] = employee_data.groupby(['department'])['last_evaluation'].transform('median')

In [49]:
employee_data.head()

,avg_monthly_hrs,department,filed_complaint,last_evaluation,n_projects,recently_promoted,salary,satisfaction,status,tenure,employee_id,dept_name,dept_head,age,gender,marital_status,le_median
0,246.0,D00-PD,0.0,0.866838,6,0.0,medium,0.134415,Left,4.0,124467,Product,Darcy Staines,42.0,Female,Married,0.732204
1,134.0,D00-PD,0.0,0.555718,2,0.0,low,0.511041,Left,3.0,112210,Product,Darcy Staines,23.0,Female,Unmarried,0.732204
2,156.0,D00-SS,1.0,0.474082,2,0.0,medium,0.405101,Left,3.0,126150,Sales,Edward J Bayley,24.0,Female,Unmarried,0.706105
3,256.0,D00-SP,0.0,0.961360,6,0.0,low,0.152974,Left,4.0,125346,Support,Amelia Westray,51.0,Female,Married,0.734583
4,146.0,D00-SS,0.0,0.507349,2,0.0,medium,0.434845,Left,3.0,113707,Sales,Edward J Bayley,23.0,Female,Unmarried,0.706105

In [50]:
employee_data['le_median'].shape

(14150,)

In [51]:
employee_data.loc[employee_data['last_evaluation'].isnull(), 'last_evaluation'] = employee_data.loc[employee_data['last_evaluation'].isnull(), 'le_median']

In [52]:
employee_data.drop(['le_median'], axis=1, inplace=True)

In [53]:
employee_data.isnull().sum()

avg_monthly_hrs        0
department             0
filed_complaint        0
last_evaluation      150
n_projects             0
recently_promoted      0
salary                 0
satisfaction         150
status                 0
tenure               150
employee_id            0
dept_name              0
dept_head              0
age                    0
gender                 0
marital_status         0
dtype: int64

In [37]:
np.nanquantile(employee_data['last_evaluation'], 0.50)

0.7288275

In [54]:
employee_data['last_evaluation'].describe()

count    14000.000000
mean         0.718966
std          0.164692
min          0.316175
25%          0.577334
50%          0.728827
75%          0.858351
max          1.000000
Name: last_evaluation, dtype: float64

In [55]:
employee_data.loc[employee_data['last_evaluation'].isnull(), 
                  'last_evaluation'] = np.nanquantile(employee_data['last_evaluation'], 0.50)

In [56]:
employee_data.isnull().sum()

avg_monthly_hrs        0
department             0
filed_complaint        0
last_evaluation        0
n_projects             0
recently_promoted      0
salary                 0
satisfaction         150
status                 0
tenure               150
employee_id            0
dept_name              0
dept_head              0
age                    0
gender                 0
marital_status         0
dtype: int64

In [ ]:
employee_data.isnull().sum()

avg_monthly_hrs        0
department             0
filed_complaint        0
last_evaluation        0
n_projects             0
recently_promoted      0
salary                 0
satisfaction         150
status                 0
tenure               150
employee_id            0
dept_name              0
dept_head              0
age                    0
gender                 0
marital_status         0
dtype: int64

### treating null values for satisfaction and tenure

In [39]:
employee_data['satisfaction'].describe()

count    14000.000000
mean         0.621212
std          0.250482
min          0.040058
25%          0.450356
50%          0.652394
75%          0.824925
max          1.000000
Name: satisfaction, dtype: float64

In [57]:
employee_data.loc[employee_data['satisfaction'].isnull(), 
                  'satisfaction'] = np.nanquantile(employee_data['satisfaction'], 0.50)

In [58]:
employee_data['tenure'].describe()

count    14000.000000
mean         3.499357
std          1.462584
min          2.000000
25%          3.000000
50%          3.000000
75%          4.000000
max         10.000000
Name: tenure, dtype: float64

In [42]:
employee_data['tenure'].value_counts(dropna=False)

3.0     6018
2.0     3023
4.0     2394
5.0     1369
6.0      660
10.0     201
7.0      180
8.0      155
NaN      150
Name: tenure, dtype: int64

In [59]:
employee_data['tenure'] = employee_data['tenure'].fillna(3.0)

In [60]:
employee_data.isnull().sum()

avg_monthly_hrs      0
department           0
filed_complaint      0
last_evaluation      0
n_projects           0
recently_promoted    0
salary               0
satisfaction         0
status               0
tenure               0
employee_id          0
dept_name            0
dept_head            0
age                  0
gender               0
marital_status       0
dtype: int64

In [61]:
150/14150

0.01060070671378092